<h1 style='text-align:center'> Database Basics </h1>

## 1. What is a Database?

A **database** is an organized place where **data is stored so it can be easily saved, searched, updated, and deleted**.

Think of it like a **digital filing cabinet**:
- Paper files → **Data**
- Folders → **Tables**
- Manual searching → **Queries**

**Example:**  
A school database may store **student names, IDs, grades, and classes**.

---

## 2. Types of Databases

### A. SQL Databases (Relational Databases)

**SQL** stands for **Structured Query Language**.

- Data is stored in **tables** (rows and columns)
- Tables can be **related to each other**
- Very structured and organized
- Best for data with a fixed format

**Example Table:**

| ID | Name | Age |
|----|------|-----|
| 1  | Alex | 15  |
| 2  | Sam  | 16  |

**Common SQL Databases:**
- MySQL
- PostgreSQL
- SQLite
- Oracle Database

---

### B. NoSQL Databases (Non-Relational Databases)

- Data is **not stored in tables**
- Structure is flexible
- Good for large or rapidly changing data

#### Types of NoSQL Databases:
- **Document-based**
- **Key-Value**
- **Graph**
- **Column-based**

**Example (MongoDB Document):**
```json
{
  "name": "Alex",
  "age": 15,
  "subjects": ["Math", "Science"]
}
```

## 3. SQL vs NoSQL (Comparison)

| Feature        | SQL             | NoSQL                      |
| -------------- | --------------- | -------------------------- |
| Data Structure | Tables          | Flexible                   |
| Schema         | Required        | Optional                   |
| Scalability    | Vertical        | Horizontal                 |
| Best For       | Structured data | Large or unstructured data |


## 4. Examples of Popular Databases

### MySQL
- SQL-based database  
- Easy to learn  
- Widely used for websites and student projects  

### PostgreSQL
- Advanced SQL database  
- Strong performance and reliability  
- Used in professional systems  

### MongoDB
- NoSQL database  
- Stores data as documents  
- Popular for web and mobile applications  

---

## 5. How Databases Work

1. A **user or application sends a request**  
   - Example: *Get all students older than 15*

2. The **database receives the request**  
   - SQL databases use **SQL queries**  
   - NoSQL databases use their **own query methods**

3. The **database searches the stored data**

4. The **requested data is returned**

5. The **application displays the results**

# <h1 style='text-align:center'> SQL (Structured Query Language) </h1>

## 1. What is SQL?

**SQL (Structured Query Language)** is used to **store, retrieve, update, and manage data** in relational databases like MySQL and PostgreSQL.

SQL works with **tables**, which contain:
- **Rows** → records
- **Columns** → fields

---


## SQL Command Types 

SQL commands are grouped based on **what they do**.  
There are **five main types of SQL commands**.

---

## 1. DDL – Data Definition Language

**DDL commands** are used to **define, create, modify, or delete database structures** such as tables and schemas.

### Common DDL Commands

#### CREATE
Creates a new database or table.
```sql
CREATE TABLE students (
  id INT,
  name VARCHAR(50),
  age INT
);
```

#### ALTER

Modifies an existing table.

```sql
ALTER TABLE students
ADD email VARCHAR(100);
```

#### DROP

Deletes a table or database permanently.

```sql
DROP TABLE students;
```

#### TRUNCATE

Deletes all rows from a table but keeps the structure.

```sql
TRUNCATE TABLE students;
```

---

## 2. DML – Data Manipulation Language

**DML commands** are used to **insert, update, delete, and retrieve data** stored in tables.

### Common DML Commands

### INSERT
**Adds new records.**

```sql
INSERT INTO students (name, age)
VALUES ('Alex', 15);
```

#### UPDATE

Modifies existing records.

```sql
UPDATE students
SET age = 16
WHERE name = 'Alex';
```

#### DELETE

Removes records.

```sql
DELETE FROM students
WHERE age < 14;
```

---

## 3. DQL – Data Query Language

**DQL** focuses only on **retrieving data**.

### Main DQL Command

### SELECT
```sql
SELECT name, age
FROM students
WHERE age > 15
ORDER BY age;
```

⚠️ **Note:**

`SELECT` is sometimes included under DML, but it is often separated as DQL because it only queries data.

---

## 4. DCL – Data Control Language

**DCL commands** control **access and permissions** for users.

### Common DCL Commands

### GRANT
**Gives permissions to users.**

```sql
GRANT SELECT, INSERT
ON students
TO user1;
```

#### REVOKE

Removes permissions from users.

```sql
REVOKE INSERT
ON students
FROM user1;
```

---

## 5. TCL – Transaction Control Language

**TCL commands** manage **transactions**, which are groups of SQL operations executed together.

### Common TCL Commands

### COMMIT
**Saves changes permanently.**

```sql
COMMIT;
```

#### ROLLBACK

Undoes changes since the last commit.

```sql
ROLLBACK;
```

#### SAVEPOINT

Sets a point to roll back to.
```sql
SAVEPOINT sp1;

ROLLBACK TO sp1;
```

---

## SQL Data Types

### 1. Numeric Data Types

| Data Type     | Description                                         | Example Values       |
|---------------|-----------------------------------------------------|--------------------|
| INT / INTEGER | Whole numbers                                       | 1, -100, 5000      |
| SMALLINT      | Smaller range of whole numbers                      | 0, 100, -32768     |
| BIGINT        | Large whole numbers                                 | 1000000000, -1     |
| DECIMAL(p,s)  | Fixed-point numbers with precision `p` and scale `s`| 10.50, 123.45      |
| NUMERIC(p,s)  | Same as DECIMAL                                     | 999.99             |
| FLOAT / REAL  | Approximate floating-point numbers                  | 3.14, 0.001        |
| DOUBLE / DOUBLE PRECISION | Higher precision floating-point numbers  | 3.14159265359      |

### 2. Character / String Data Types

| Data Type      | Description                         | Example Values        |
|----------------|-------------------------------------|---------------------|
| CHAR(n)        | Fixed-length string of length `n`  | 'A', 'SQL'          |
| VARCHAR(n)     | Variable-length string up to `n`   | 'Hello', 'ChatGPT'  |
| TEXT           | Large variable-length text          | 'This is a long paragraph...' |

### 3. Date and Time Data Types

| Data Type      | Description                         | Example Values        |
|----------------|-------------------------------------|---------------------|
| DATE           | Stores date only                     | '2025-12-30'        |
| TIME           | Stores time only                     | '14:30:00'          |
| DATETIME       | Stores date and time                 | '2025-12-30 14:30:00'|
| TIMESTAMP      | Stores date and time, often auto-updated | '2025-12-30 14:30:00'|
| YEAR           | Stores year only                     | 2025                 |

### 4. Boolean Data Type

| Data Type      | Description                         | Example Values        |
|----------------|-------------------------------------|---------------------|
| BOOLEAN / BOOL | Stores TRUE or FALSE                 | TRUE, FALSE          |

### 5. Miscellaneous / Other Data Types

| Data Type      | Description                         | Example Values        |
|----------------|-------------------------------------|---------------------|
| BLOB / BYTEA   | Binary data (images, files, etc.)  | Binary files         |
| ENUM           | Predefined list of values           | 'small', 'medium', 'large' |
| JSON / JSONB   | Stores JSON data                     | '{"name": "Alice"}'  |


---

## SQL Constraints

| Column Type          | Constraint         | Description                                      | Example SQL Column Definition                  |
|---------------------|------------------|-------------------------------------------------|-----------------------------------------------|
| INT                 | PRIMARY KEY       | Uniquely identifies each row, cannot be NULL   | `id INT PRIMARY KEY`                          |
| INT                 | FOREIGN KEY       | Links to primary key in another table          | `user_id INT, FOREIGN KEY(user_id) REFERENCES users(id)` |
| VARCHAR(n)          | NOT NULL          | Value cannot be NULL                            | `name VARCHAR(50) NOT NULL`                   |
| VARCHAR(n)          | UNIQUE            | Value must be unique                            | `email VARCHAR(100) UNIQUE`                   |
| INT                 | CHECK             | Enforces a condition on values                  | `age INT CHECK (age >= 18)`                   |
| VARCHAR(n)          | DEFAULT           | Provides default value if none is given        | `status VARCHAR(10) DEFAULT 'active'`        |
| INT / BIGINT        | AUTO_INCREMENT / SERIAL | Automatically generates unique numbers       | `id INT AUTO_INCREMENT` (MySQL) / `id SERIAL` (PostgreSQL) |
| Any                 | INDEX             | Speeds up data retrieval                        | `CREATE INDEX idx_name ON users(name)`        |
| ENUM / VARCHAR(n)   | CHECK / ENUM      | Restrict values to predefined list             | `size ENUM('small','medium','large')`        |


---

### Quick Examples in a Table Creation

```sql
CREATE TABLE users (
    id INT PRIMARY KEY AUTO_INCREMENT,
    name VARCHAR(50) NOT NULL,
    email VARCHAR(100) UNIQUE,
    age INT CHECK (age >= 18),
    status VARCHAR(10) DEFAULT 'active',
    role ENUM('admin','user','guest')
);
```

**Tips:**

- PRIMARY KEY implies NOT NULL automatically.
- FOREIGN KEY maintains referential integrity.
- CHECK can be used for numeric ranges, string patterns, or even dates.
- DEFAULT helps reduce NULLs and sets standard values.
- Use INDEX for columns you query often to speed up searches.

---

## SQL Operators

### 1. Arithmetic Operators
| Operator | Description                  | Example                |
|----------|------------------------------|----------------------|
| +        | Addition                     | `SELECT 5 + 3;`      |
| -        | Subtraction                  | `SELECT 5 - 3;`      |
| *        | Multiplication               | `SELECT 5 * 3;`      |
| /        | Division                     | `SELECT 10 / 2;`     |
| %        | Modulus (remainder)          | `SELECT 10 % 3;`     |

### 2. Comparison Operators
| Operator | Description                  | Example                       |
|----------|------------------------------|-------------------------------|
| =        | Equal to                     | `WHERE age = 18`              |
| <> or != | Not equal to                 | `WHERE age <> 18`             |
| >        | Greater than                 | `WHERE age > 18`              |
| <        | Less than                    | `WHERE age < 18`              |
| >=       | Greater than or equal to     | `WHERE age >= 18`             |
| <=       | Less than or equal to        | `WHERE age <= 18`             |

### 3. Logical Operators
| Operator | Description                  | Example                        |
|----------|------------------------------|--------------------------------|
| AND      | Both conditions must be true | `WHERE age >= 18 AND city='NY'`|
| OR       | At least one condition true  | `WHERE age < 18 OR city='NY'` |
| NOT      | Negates a condition          | `WHERE NOT city='NY'`          |

### 4. String Operators
| Operator | Description                  | Example                        |
|----------|------------------------------|--------------------------------|
| LIKE     | Pattern matching             | `WHERE name LIKE 'A%'`         |
| PIPE (ll)       | String concatenation         | `SELECT 'Hello' ``PIPE`` ' World';`  |

### 5. Set Operators
| Operator | Description                  | Example                        |
|----------|------------------------------|--------------------------------|
| IN       | Matches any value in a list  | `WHERE age IN (18, 21, 25)`    |
| NOT IN   | Does not match any value     | `WHERE age NOT IN (18, 21)`    |
| BETWEEN  | Between two values (inclusive)| `WHERE age BETWEEN 18 AND 25` |
| NOT BETWEEN | Not in a range             | `WHERE age NOT BETWEEN 18 AND 25` |

### 6. Null Operators
| Operator | Description                  | Example                        |
|----------|------------------------------|--------------------------------|
| IS NULL  | Checks for NULL value         | `WHERE address IS NULL`        |
| IS NOT NULL | Checks for NOT NULL value   | `WHERE address IS NOT NULL`    |

### 7. Set Operations
| Operator     | Description | Removes Duplicates? | Example |
|-------------|-------------|-------------------|---------|
| `UNION`     | Combines results of two queries and **removes duplicates**. | Yes | ```sql SELECT customer_id FROM orders_online UNION SELECT customer_id FROM orders_offline; ``` |
| `UNION ALL` | Combines results of two queries and **keeps duplicates**. | No  | ```sql SELECT customer_id FROM orders_online UNION ALL SELECT customer_id FROM orders_offline; ``` |
| `INTERSECT` | Returns only the rows **common to both queries**. | Yes | ```sql SELECT customer_id FROM orders_online INTERSECT SELECT customer_id FROM orders_offline; ``` |
| `EXCEPT`    | Returns rows **in the first query but not in the second** (SQL Server/PostgreSQL). | Yes | ```sql SELECT customer_id FROM orders_online EXCEPT SELECT customer_id FROM orders_offline; ``` |
| `MINUS`     | Returns rows **in the first query but not in the second** (Oracle). | Yes | ```sql SELECT customer_id FROM orders_online MINUS SELECT customer_id FROM orders_offline; ``` |

---

**Notes**

- Number of columns and data types must match in both queries.
- Column names in the final result are taken from the **first query**.
- Parentheses `()` can be used to control order when combining multiple set operators.

**Example with multiple set operators:**
```sql
(SELECT id FROM table1
 UNION
 SELECT id FROM table2)
EXCEPT
SELECT id FROM table3;
```
---

## SQL Aggregate Functions & Clauses

### 1. Aggregate Functions
| Function        | Description                                      | Example                               |
|-----------------|-------------------------------------------------|---------------------------------------|
| COUNT(column)    | Counts number of rows (excluding NULLs)        | `SELECT COUNT(id) FROM users;`       |
| COUNT(*)         | Counts all rows (including NULLs)             | `SELECT COUNT(*) FROM users;`        |
| SUM(column)      | Calculates total sum of a numeric column      | `SELECT SUM(salary) FROM employees;` |
| AVG(column)      | Calculates average of a numeric column        | `SELECT AVG(age) FROM users;`        |
| MIN(column)      | Finds minimum value                            | `SELECT MIN(salary) FROM employees;` |
| MAX(column)      | Finds maximum value                            | `SELECT MAX(salary) FROM employees;` |

---

### 2. WHERE Clause
- Filters rows **before aggregation**.
```sql
SELECT * FROM employees
WHERE age > 25;
```
---

### 3. GROUP BY Clause

Groups rows based on one or more columns.

Often used with aggregate functions.

```sql
SELECT department, COUNT(*) AS num_employees
FROM employees
GROUP BY department;
```
---

### 4. HAVING Clause

Filters groups after aggregation (similar to WHERE but for groups).

```sql
SELECT department, AVG(salary) AS avg_salary
FROM employees
GROUP BY department
HAVING AVG(salary) > 50000;
```
---

### 5. ORDER BY Clause

Sorts the result set by one or more columns.

Default is ASC (ascending); DESC for descending.

```sql
SELECT name, salary
FROM employees
ORDER BY salary DESC;
```
---

### 6. Combining WHERE, GROUP BY, HAVING, ORDER BY

```sql
SELECT department, COUNT(*) AS num_employees, AVG(salary) AS avg_salary
FROM employees
WHERE age > 25
GROUP BY department
HAVING AVG(salary) > 50000
ORDER BY avg_salary DESC;
```

### 7. When & Case Clause

The **`CASE` statement** in SQL allows you to perform conditional logic within your queries. It's similar to an "if-then-else" in programming.

#### Syntax

**Simple CASE**

```sql
SELECT column_name,
       CASE column_name
           WHEN value1 THEN result1
           WHEN value2 THEN result2
           ...
           ELSE default_result
       END AS alias_name
FROM table_name;
```
**Searched Case**

```sql
SELECT column_name,
       CASE
           WHEN condition1 THEN result1
           WHEN condition2 THEN result2
           ...
           ELSE default_result
       END AS alias_name
FROM table_name;
```

#### Key Points
- CASE must end with END.
- WHEN defines the condition or value to check.
- ELSE is optional; if omitted, unmatched cases return NULL.
- Can be used in SELECT, ORDER BY, WHERE, and GROUP BY clauses.

---

**Quick Tips:**
- WHERE filters rows before aggregation.
- HAVING filters groups after aggregation.
- GROUP BY is required when using aggregate functions on specific columns.
- ORDER BY controls the sorting of the final result.

# SQL Subqueries

## 1. What is a Subquery?
- A **subquery** is a query **nested inside another query**.
- Can be used in `SELECT`, `FROM`, `WHERE`, or `HAVING` clauses.
- Often enclosed in parentheses `()`.

---

### 2. Types of Subqueries

#### a) Subquery in WHERE Clause
- Returns a value or set of values to filter rows.

```sql
-- Find employees whose salary is above the average
SELECT name, salary
FROM employees
WHERE salary > (SELECT AVG(salary) FROM employees);
```

#### b) Subquery in FROM Clause (Derived Table)

Treats the subquery as a temporary table.

```sql
-- Find departments with average salary above 50000
SELECT department, avg_salary
FROM (SELECT department, AVG(salary) AS avg_salary
      FROM employees
      GROUP BY department) AS dept_avg
WHERE avg_salary > 50000;
```

#### c) Subquery in SELECT Clause

Returns a value for each row.

```sql
-- Show employee and their department's average salary
SELECT name,
       (SELECT AVG(salary) 
        FROM employees 
        WHERE department = e.department) AS dept_avg_salary
FROM employees e;
```
---

### 3. Correlated vs Non-Correlated Subqueries

| Type           | Description                                   | Example                                                                                                                    |
| -------------- | --------------------------------------------- | -------------------------------------------------------------------------------------------------------------------------- |
| Non-Correlated | Independent subquery; can run alone           | `SELECT * FROM employees WHERE salary > (SELECT AVG(salary) FROM employees);`                                              |
| Correlated     | Depends on the outer query; runs for each row | `SELECT name FROM employees e1 WHERE salary > (SELECT AVG(salary) FROM employees e2 WHERE e2.department = e1.department);` |

---

#### 4. Using Subqueries with IN, ANY, ALL

```sql
-- Using IN
SELECT name
FROM employees
WHERE department IN (SELECT department FROM employees WHERE salary > 50000);

-- Using ANY
SELECT name
FROM employees
WHERE salary > ANY (SELECT salary FROM employees WHERE department = 'Sales');

-- Using ALL
SELECT name
FROM employees
WHERE salary > ALL (SELECT salary FROM employees WHERE department = 'HR');
```

**Tips:**
- Use IN for multiple possible matches.
- Use EXISTS for checking presence of rows.
- Correlated subqueries can be slower on large tables; use joins if performance matters.

---

## SQL Joins 

### 1. What is a Join?
- **Join** combines rows from **two or more tables** based on a related column.
- Most commonly, joins use a **primary key – foreign key relationship**.

---

### 2. Types of Joins

#### a) INNER JOIN
- Returns **only matching rows** from both tables.
```sql
SELECT e.name, d.department_name
FROM employees e
INNER JOIN departments d
ON e.department_id = d.id;
```

#### b) LEFT JOIN (or LEFT OUTER JOIN)

Returns all rows from the left table, and matched rows from the right table.

If no match, right table columns show NULL.

```sql
SELECT e.name, d.department_name
FROM employees e
LEFT JOIN departments d
ON e.department_id = d.id;
```

#### c) RIGHT JOIN (or RIGHT OUTER JOIN)

Returns all rows from the right table, and matched rows from the left table.

If no match, left table columns show NULL.

```sql
SELECT e.name, d.department_name
FROM employees e
RIGHT JOIN departments d
ON e.department_id = d.id;
```

#### d) FULL JOIN (or FULL OUTER JOIN)

Returns all rows when there is a match in either table.

Unmatched columns will be NULL.

```sql
SELECT e.name, d.department_name
FROM employees e
FULL OUTER JOIN departments d
ON e.department_id = d.id;
```
#### e) CROSS JOIN

Returns all possible combinations of rows from both tables (Cartesian product).

```sql
SELECT e.name, d.department_name
FROM employees e
CROSS JOIN departments d;
```

#### f) SELF JOIN

Joins a table with itself.

```sql
SELECT e1.name AS Employee, e2.name AS Manager
FROM employees e1
LEFT JOIN employees e2
ON e1.manager_id = e2.id;
```
---

**Tips & Summary:**

| Join Type  | Description               | Rows Returned             |
| ---------- | ------------------------- | ------------------------- |
| INNER JOIN | Only matching rows        | Intersection              |
| LEFT JOIN  | All left + matching right | Left + intersection       |
| RIGHT JOIN | All right + matching left | Right + intersection      |
| FULL JOIN  | All rows from both tables | Union of both tables      |
| CROSS JOIN | Cartesian product         | All combinations          |
| SELF JOIN  | Join table with itself    | Depends on join condition |


- Use INNER JOIN for matching data only.
- Use LEFT JOIN if you need all rows from one table, even if no match exists.
- CROSS JOIN can produce very large result sets—use carefully.
- Always specify ON conditions unless it’s a CROSS JOIN.

---

## SQL WITH Clause & Window Functions

---

### 1. WITH Clause (Common Table Expressions - CTE)
- Creates a **temporary named result set** that can be referenced in a query.
- Useful for breaking complex queries into readable parts.

#### Syntax:
```sql
WITH cte_name AS (
    SELECT column1, column2
    FROM table
    WHERE condition
)
SELECT *
FROM cte_name
WHERE another_condition;
```

**Example:**

```sql
WITH dept_avg AS (
    SELECT department_id, AVG(salary) AS avg_salary
    FROM employees
    GROUP BY department_id
)
SELECT e.name, e.salary, d.avg_salary
FROM employees e
JOIN dept_avg d
ON e.department_id = d.department_id
WHERE e.salary > d.avg_salary;
```
---

### 2. Window Functions

Perform calculations across a set of rows related to the current row.

Do not collapse rows like aggregate functions.

Commonly used with `OVER()` clause.

#### Syntax:
```sql
FUNCTION_NAME(column) OVER (
    [PARTITION BY column1, column2]
    [ORDER BY column3]
)
```

#### Common Window Functions:

| Function        | Description                                         | Example                                                               |
| --------------- | --------------------------------------------------- | --------------------------------------------------------------------- |
| ROW_NUMBER()    | Assigns a unique sequential number to each row      | `ROW_NUMBER() OVER (PARTITION BY department_id ORDER BY salary DESC)` |
| RANK()          | Assigns rank; same values get same rank, gaps exist | `RANK() OVER (PARTITION BY department_id ORDER BY salary DESC)`       |
| DENSE_RANK()    | Assigns rank; same values get same rank, no gaps    | `DENSE_RANK() OVER (PARTITION BY department_id ORDER BY salary DESC)` |
| SUM(column)     | Cumulative sum over partition                       | `SUM(salary) OVER (PARTITION BY department_id ORDER BY salary)`       |
| AVG(column)     | Moving/partitioned average                          | `AVG(salary) OVER (PARTITION BY department_id)`                       |
| LAG(column, n)  | Access previous row value                           | `LAG(salary, 1) OVER (PARTITION BY department_id ORDER BY salary)`    |
| LEAD(column, n) | Access next row value                               | `LEAD(salary, 1) OVER (PARTITION BY department_id ORDER BY salary)`   |


**Example Combining WITH & Window Functions**

```sql
WITH ranked_employees AS (
    SELECT name, department_id, salary,
           RANK() OVER (PARTITION BY department_id ORDER BY salary DESC) AS dept_rank
    FROM employees
)
SELECT *
FROM ranked_employees
WHERE dept_rank = 1; 
```
---

**Tips:**

- CTE improves readability for complex queries, can be recursive.
- Window functions are powerful for ranking, running totals, moving averages, and comparisons without collapsing rows.
- Always use PARTITION BY to define groups for window functions; ORDER BY defines the order within each group.

---

## Advanced Concepts: Normalization and Pivot Tables

### 1. Normalization in SQL

**Normalization** is the process of organizing data in a database to reduce redundancy and improve data integrity. It involves dividing large tables into smaller, related tables and defining relationships between them.

#### Normal Forms

| Normal Form | Description | Example |
|-------------|-------------|---------|
| **1NF (First Normal Form)** | Eliminate repeating groups; each column should have atomic values. | A table with multiple phone numbers in one column should be split into separate rows. |
| **2NF (Second Normal Form)** | Achieve 1NF and ensure that all non-key columns are fully dependent on the primary key. | Split a table that has partial dependency on a composite key. |
| **3NF (Third Normal Form)** | Achieve 2NF and remove transitive dependency (non-key columns should not depend on other non-key columns). | Separate tables for `Student` and `Course` if `CourseName` depends on `CourseID`. |
| **BCNF (Boyce-Codd Normal Form)** | A stronger version of 3NF where every determinant is a candidate key. | Ensures stricter rules for tables with multiple candidate keys. |

#### Example of Normalization

**Before Normalization:**

| StudentID | StudentName | CourseID | CourseName |
|-----------|------------|----------|------------|
| 1         | Alice      | 101      | Math       |
| 2         | Bob        | 102      | Physics    |

**After Normalization:**

**Students Table**

| StudentID | StudentName |
|-----------|------------|
| 1         | Alice      |
| 2         | Bob        |

**Courses Table**

| CourseID | CourseName |
|----------|-----------|
| 101      | Math      |
| 102      | Physics   |

**Enrollment Table**

| StudentID | CourseID |
|-----------|----------|
| 1         | 101      |
| 2         | 102      |

---

### 2. Pivot Tables in SQL

A Pivot Table in SQL is used to transform rows into columns for better data analysis.

Basic Syntax (Using `CASE` or `PIVOT`)

Using `CASE` (SQL Standard Way):

```sql
SELECT
    EmployeeID,
    SUM(CASE WHEN Month = 'Jan' THEN Sales ELSE 0 END) AS Jan_Sales,
    SUM(CASE WHEN Month = 'Feb' THEN Sales ELSE 0 END) AS Feb_Sales,
    SUM(CASE WHEN Month = 'Mar' THEN Sales ELSE 0 END) AS Mar_Sales
FROM Sales
GROUP BY EmployeeID;
```

Using `PIVOT` (SQL Server):

```sql
SELECT *
FROM
(
    SELECT EmployeeID, Month, Sales
    FROM Sales
) AS SourceTable
PIVOT
(
    SUM(Sales)
    FOR Month IN ([Jan], [Feb], [Mar])
) AS PivotTable;
```

#### Example: Pivot Table in SQL

**Sales Table**

| EmployeeID | Month | Sales |
|------------|-------|-------|
| 1          | Jan   | 100   |
| 1          | Feb   | 120   |
| 2          | Jan   | 90    |

**Pivot Table Result**

| EmployeeID | Jan | Feb | Mar |
|------------|-----|-----|-----|
| 1          | 100 | 120 | 0   |
| 2          | 90  | 0   | 0   |


---
# <center> *End of Topic* </center>